src/cf/Catalogs/ФизическиеЛица.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>ФизическиеЛица</Name>
			<Comment>АПК:413 История выбора важна для отв.лиц. Из-за наличия ОбработкаПолученияДанныхВыбора должна отключаться в потребителях</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаРождения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пол</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПолФизическогоЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИНН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтраховойНомерПФР</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>14</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МестоРождения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>240</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаДоступа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыДоступаФизическихЛиц</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьПол</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.УдалитьПолФизическихЛиц</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФИО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УточнениеНаименования</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРегистрации</Name>
					<Comment>Дата регистрации</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеСлужебное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>120</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойБанковскийСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛьготаПриНачисленииПособий</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ОснованияФинансированияПособияФедеральнымБюджетом</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПостоянноПроживалВКрыму18Марта2014Года</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Фамилия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Имя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отчество</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МестоРожденияПредставление</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>240</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Инициалы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьИнициалыИмени</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФаксимилеПодписи</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛицаПрисоединенныеФайлы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрименяетсяФЗ_20_2023</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФактПроживанияДНРЛНРЗОХО</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФактПроживанияДНРЛНР</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФактПроживанияЗОХО</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>КонтактнаяИнформация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вид</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначенияПолей</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Страна</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Регион</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Город</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресЭП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоменноеИмяСервера</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефона</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефонаБезКодов</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидДляСписка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/InformationRegisters/ДокументыФизическихЛиц.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ДокументыФизическихЛиц</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Серия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>14</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Номер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаВыдачи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СрокДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КемВыдан</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодПодразделения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЯвляетсяДокументомУдостоверяющимЛичность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Представление</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьВидДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыДокументовФизическихЛиц</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФамилияЛатиницей</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИмяЛатиницей</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтранаВыдачи</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтраныМира</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КатегорииТранспортныхСредств</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Физлицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыДокументовФизическихЛиц</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/ГражданствоФизическихЛиц.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ГражданствоФизическихЛиц</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Страна</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтраныМира</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИНН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Catalogs/ФизическиеЛица/Forms/НекорректныеРеквизиты/Ext/Form/Module.bsl
#Область ОписаниеПеременных

&НаКлиенте
Перем ТекущееЗначение;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Заголовок = СтрШаблон(НСтр("ru = '%1 (Заполнить реквизиты)'"), Объект.Ссылка);
	
	НекорректныеРеквизиты = Параметры.НекорректныеРеквизиты;
	Если Не ЗначениеЗаполнено(НекорректныеРеквизиты) Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Для Каждого ОписаниеОшибки Из НекорректныеРеквизиты Цикл
		
		ПроверяемыйРеквизит = ПереданныеРеквизиты.Добавить();
		ИмяРеквизита = ОписаниеОшибки.ИмяРеквизита;
		ПроверяемыйРеквизит.ИмяРеквизита = ИмяРеквизита;
		ПроверяемыйРеквизит.ТекстОшибки = ОписаниеОшибки.ТекстОшибки;
		
		Если СтрНачинаетсяС(ИмяРеквизита, ИнтеграцияАУСНКлиентСервер.ПрефиксРеквизитаСведенийДокумента()) Тогда
			Элементы.ГруппаСведенияДокумента.Видимость = Истина;
		Иначе
			ИмяЭлемента = СтрШаблон("Группа%1", ИмяРеквизита);
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, ИмяЭлемента, "Видимость", Истина);
		КонецЕсли;
		
		ИмяЭлементаОписаниеОшибки = СтрШаблон("%1%2", ПрефиксДекорацииСОписаниемОшибки(), ИмяРеквизита);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			Элементы, ИмяЭлементаОписаниеОшибки, "Заголовок", ОписаниеОшибки.ТекстОшибки);
		
	КонецЦикла;
		
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ПрочитатьПаспортныеДанныеФизическогоЛица();
	ПрочитатьГражданствоФизическогоЛица();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если РеквизитыЗаполненыКорректно() Тогда
		ПроверкаЗаполненияВыполненаУспешно = Истина;
	Иначе
		ПроверкаЗаполненияВыполненаУспешно = Ложь;
		Отказ = Истина;
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Некорректно заполнены реквизиты'"));
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если ИзменилосьНаименование Тогда
		ОбновитьНаименованиеФизЛицаИСотрудника(ТекущийОбъект);
	КонецЕсли;
	
	Если ИзменилисьДанныеДокумента Тогда
		МенеджерЗаписи = РегистрыСведений.ДокументыФизическихЛиц.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(МенеджерЗаписи, ДокументыФизическогоЛица);
		МенеджерЗаписи.Физлицо = Объект.Ссылка;
		Если Не ЗначениеЗаполнено(МенеджерЗаписи.Период) Тогда
			МенеджерЗаписи.Период = ОбщегоНазначения.ТекущаяДатаПользователя();
		КонецЕсли;
		МенеджерЗаписи.ЯвляетсяДокументомУдостоверяющимЛичность = Истина;
		СнятьПризнакУдостоверяющегоЛичностьСДругогоДокумента(
			Объект.Ссылка, МенеджерЗаписи.ВидДокумента, МенеджерЗаписи.Период);
		МенеджерЗаписи.Записать(Истина);
	КонецЕсли;
	
	Если ИзменилосьГражданство Тогда
		МенеджерЗаписи = РегистрыСведений.ГражданствоФизическихЛиц.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(МенеджерЗаписи, ГражданствоФизическихЛиц);
		МенеджерЗаписи.Записать(Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	Если Не ЗавершениеРаботы Тогда
		Если ПроверкаЗаполненияВыполненаУспешно Тогда
			ПроверкаПройдена = Истина;
		ИначеЕсли Модифицированность Тогда
			ПроверкаПройдена = Ложь;
		Иначе
			ПроверкаПройдена = РеквизитыЗаполненыКорректно();
		КонецЕсли;
		Оповестить(ИнтеграцияАУСНКлиент.ИмяСобытияИсправленыОшибкиОбмена(), ПроверкаПройдена, Объект.Ссылка);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ИННПриИзменении(Элемент)
	
	ПроверитьИНН();
	
КонецПроцедуры

&НаКлиенте
Процедура ИННИзменениеТекстаРедактирования(Элемент, Текст, СтандартнаяОбработка)
	
	ТекущееЗначение = Текст;
	ПодключитьОбработчикОжидания("ПроверитьИНН", 0.1, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура СтраховойНомерПФРПриИзменении(Элемент)
	
	ПроверитьСНИЛС();
	
КонецПроцедуры

&НаКлиенте
Процедура СтраховойНомерПФРИзменениеТекстаРедактирования(Элемент, Текст, СтандартнаяОбработка)
	
	ТекущееЗначение = Текст;
	ПодключитьОбработчикОжидания("ПроверитьСНИЛС", 0.1, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ИмяПриИзменении(Элемент)
	
	ПроверитьИмя();
	ИзменилосьНаименование = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ИмяИзменениеТекстаРедактирования(Элемент, Текст, СтандартнаяОбработка)
	
	ТекущееЗначение = Текст;
	ПодключитьОбработчикОжидания("ПроверитьИмя", 0.1, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ФамилияПриИзменении(Элемент)
	
	ПроверитьФамилию();
	ИзменилосьНаименование = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ФамилияИзменениеТекстаРедактирования(Элемент, Текст, СтандартнаяОбработка)
	
	ТекущееЗначение = Текст;
	ПодключитьОбработчикОжидания("ПроверитьФамилию", 0.1, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтчествоПриИзменении(Элемент)
	
	ПроверитьОтчество();
	ИзменилосьНаименование = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтчествоИзменениеТекстаРедактирования(Элемент, Текст, СтандартнаяОбработка)
	
	ТекущееЗначение = Текст;
	ПодключитьОбработчикОжидания("ПроверитьОтчество", 0.1, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ДокументыВидДокументаПриИзменении(Элемент)
	
	ПроверитьСведенияДокумента();
	ИзменилисьДанныеДокумента = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура СерияПриИзменении(Элемент)
	
	ПроверитьСерию();
	ИзменилисьДанныеДокумента = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура СведенияДокумента_СерияИзменениеТекстаРедактирования(Элемент, Текст, СтандартнаяОбработка)
	
	ТекущееЗначение = Текст;
	ПодключитьОбработчикОжидания("ПроверитьСерию", 0.1, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура НомерПриИзменении(Элемент)
	
	ПроверитьНомер();
	ИзменилисьДанныеДокумента = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура СведенияДокумента_НомерИзменениеТекстаРедактирования(Элемент, Текст, СтандартнаяОбработка)
	
	ТекущееЗначение = Текст;
	ПодключитьОбработчикОжидания("ПроверитьНомер", 0.1, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаРожденияПриИзменении(Элемент)
	
	ТекстОшибки = "";
	ИнтеграцияАУСНКлиентСервер.ДатаРожденияСоответствуетПротоколуОбмена(Объект.ДатаРождения, ТекстОшибки);
	ИзменитьПереданныеРеквизиты("ДатаРождения", ТекстОшибки);
	
КонецПроцедуры

&НаКлиенте
Процедура ГражданствоФизическихЛиц_СтранаПриИзменении(Элемент)
	
	ПроверитьГражданство();
	ИзменилосьГражданство = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ПолПриИзменении(Элемент)
	
	ТекстОшибки = "";
	ИнтеграцияАУСНКлиентСервер.ПолФизическогоЛицаСоответствуетПротоколуОбмена(Объект.Пол, ТекстОшибки);
	ИзменитьПереданныеРеквизиты("Пол", ТекстОшибки);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Функция РеквизитыЗаполненыКорректно()
	
	ПроверкаПройдена = Истина;
	Для Каждого Реквизит Из ПереданныеРеквизиты Цикл
		Если Не ПроверкаПройдена Тогда
			Прервать;
		КонецЕсли;
		ПроверкаПройдена = Не ЗначениеЗаполнено(Реквизит.ТекстОшибки);
	КонецЦикла;
	
	Возврат ПроверкаПройдена;
	
КонецФункции

&НаКлиенте
Процедура ПроверитьСНИЛС()
	
	ТекстОшибки = "";
	ПроверяемоеЗначение = ?(ЗначениеЗаполнено(ТекущееЗначение), ТекущееЗначение, Объект.СтраховойНомерПФР);
	РегламентированныеДанныеКлиентСервер.СтраховойНомерПФРСоответствуетТребованиям(ПроверяемоеЗначение, ТекстОшибки);
	ИзменитьПереданныеРеквизиты("СНИЛС", ТекстОшибки);
	ТекущееЗначение = "";
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьИНН()
	
	ТекстОшибки = "";
	ПроверяемоеЗначение = ?(ЗначениеЗаполнено(ТекущееЗначение), ТекущееЗначение, Объект.ИНН);
	ИнтеграцияАУСНКлиентСервер.ИННСоответствуетПротоколуОбмена(ПроверяемоеЗначение, ТекстОшибки);
	ИзменитьПереданныеРеквизиты("ИНН", ТекстОшибки);
	ТекущееЗначение = "";
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьИмя()
	
	ТекстОшибки = "";
	ПроверяемоеЗначение = ?(ЗначениеЗаполнено(ТекущееЗначение), ТекущееЗначение, Объект.Имя);
	ИнтеграцияАУСНКлиентСервер.ФИОСоответствуетПротоколуОбмена(ПроверяемоеЗначение, ТекстОшибки);
	ИзменитьПереданныеРеквизиты("Имя", ТекстОшибки);
	ТекущееЗначение = "";
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьГражданство()
	
	ТекстОшибки = "";
	КодСтраны = КодСтраныГражданства(ГражданствоФизическихЛиц.Страна);
	ИнтеграцияАУСНКлиентСервер.КодГражданстваСоответствуетПротоколуОбмена(КодСтраны, ТекстОшибки);
	ИзменитьПереданныеРеквизиты("Страна", ТекстОшибки);
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьФамилию()
	
	ТекстОшибки = "";
	ПроверяемоеЗначение = ?(ЗначениеЗаполнено(ТекущееЗначение), ТекущееЗначение, Объект.Фамилия);
	ИнтеграцияАУСНКлиентСервер.ФИОСоответствуетПротоколуОбмена(ПроверяемоеЗначение, ТекстОшибки);
	ИзменитьПереданныеРеквизиты("Фамилия", ТекстОшибки);
	ТекущееЗначение = "";
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьОтчество()
	
	ТекстОшибки = "";
	ПроверяемоеЗначение = ?(ЗначениеЗаполнено(ТекущееЗначение), ТекущееЗначение, Объект.Отчество);
	ИнтеграцияАУСНКлиентСервер.ФИОСоответствуетПротоколуОбмена(ПроверяемоеЗначение, ТекстОшибки);
	ИзменитьПереданныеРеквизиты("Отчество", ТекстОшибки);
	ТекущееЗначение = "";
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьСведенияДокумента()
	
	ТекстОшибки = "";
	ПрефиксСведенияДокумента = ИнтеграцияАУСНКлиентСервер.ПрефиксРеквизитаСведенийДокумента();
	ИнтеграцияАУСНВызовСервера.ВидДокументаСоответствуетПротоколуОбмена(
		ДокументыФизическогоЛица.ВидДокумента, ТекстОшибки);
	ИзменитьПереданныеРеквизиты(СтрШаблон("%1ВидДокумента", ПрефиксСведенияДокумента), ТекстОшибки);
	
	ПроверитьСерию();
	
	ПроверитьНомер();
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьСерию()
	
	ПрефиксСведенияДокумента = ИнтеграцияАУСНКлиентСервер.ПрефиксРеквизитаСведенийДокумента();
	ТекстОшибки = "";
	ПроверяемоеЗначение = ?(ЗначениеЗаполнено(ТекущееЗначение), ТекущееЗначение, ДокументыФизическогоЛица.Серия);
	ИнтеграцияАУСНКлиентСервер.СерияДокументаСоответствуетПротоколуОбмена(
		ДокументыФизическогоЛица.ВидДокумента, ПроверяемоеЗначение, ТекстОшибки);
	ИзменитьПереданныеРеквизиты(СтрШаблон("%1Серия", ПрефиксСведенияДокумента), ТекстОшибки);
	ТекущееЗначение = "";
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьНомер()
	
	ПрефиксСведенияДокумента = ИнтеграцияАУСНКлиентСервер.ПрефиксРеквизитаСведенийДокумента();
	ТекстОшибки = "";
	ПроверяемоеЗначение = ?(ЗначениеЗаполнено(ТекущееЗначение), ТекущееЗначение, ДокументыФизическогоЛица.Номер);
	ИнтеграцияАУСНКлиентСервер.НомерДокументаСоответствуетПротоколуОбмена(
		ДокументыФизическогоЛица.ВидДокумента, ПроверяемоеЗначение, ТекстОшибки);
	ИзменитьПереданныеРеквизиты(СтрШаблон("%1Номер", ПрефиксСведенияДокумента), ТекстОшибки);
	ТекущееЗначение = "";
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ПрефиксДекорацииСОписаниемОшибки()
	
	Возврат "НадписьОшибкиЗаполнения";
	
КонецФункции

&НаКлиенте
Процедура ИзменитьПереданныеРеквизиты(ИмяРеквизита, ТекстОшибки)
	
	ИмяЭлемента = СтрШаблон("%1%2", ПрефиксДекорацииСОписаниемОшибки(), ИмяРеквизита);
	
	Видимость = ЗначениеЗаполнено(ТекстОшибки);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, ИмяЭлемента, "Видимость", Видимость);
	
	Если Видимость Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			Элементы, ИмяЭлемента, "Заголовок", ТекстОшибки);
	КонецЕсли;
	
	Отбор = Новый Структура("ИмяРеквизита", ИмяРеквизита);
	НайденныеСтроки = ПереданныеРеквизиты.НайтиСтроки(Отбор);
	Если ЗначениеЗаполнено(НайденныеСтроки) Тогда
		НайденныеСтроки[0].ТекстОшибки = ТекстОшибки;
	ИначеЕсли ЗначениеЗаполнено(ТекстОшибки) Тогда
		НоваяСтрока = ПереданныеРеквизиты.Добавить();
		НоваяСтрока.ИмяРеквизита = ИмяРеквизита;
		НоваяСтрока.ТекстОшибки = ТекстОшибки;
	КонецЕсли;
	
	ТекстОшибки = "";
	
КонецПроцедуры

&НаСервере
Процедура ПрочитатьПаспортныеДанныеФизическогоЛица()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДокументыФизическихЛицСрезПоследних.Физлицо КАК Физлицо,
		|	ДокументыФизическихЛицСрезПоследних.ВидДокумента КАК ВидДокумента,
		|	ДокументыФизическихЛицСрезПоследних.Период КАК Период
		|ИЗ
		|	РегистрСведений.ДокументыФизическихЛиц.СрезПоследних(
		|			,
		|			Физлицо = &ФизЛицо
		|				И ВидДокумента = ЗНАЧЕНИЕ(Справочник.ВидыДокументовФизическихЛиц.ПаспортРФ)) КАК ДокументыФизическихЛицСрезПоследних
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ДокументыФизическихЛицСрезПоследних.Физлицо,
		|	ДокументыФизическихЛицСрезПоследних.ВидДокумента,
		|	ДокументыФизическихЛицСрезПоследних.Период
		|ИЗ
		|	РегистрСведений.ДокументыФизическихЛиц.СрезПоследних(
		|			,
		|			Физлицо = &ФизЛицо
		|				И ЯвляетсяДокументомУдостоверяющимЛичность) КАК ДокументыФизическихЛицСрезПоследних";
	
	Запрос.УстановитьПараметр("ФизЛицо", Объект.Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		МенеджерЗаписи = РегистрыСведений.ДокументыФизическихЛиц.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Физлицо = Объект.Ссылка;
		МенеджерЗаписи.ВидДокумента = Выборка.ВидДокумента;
		МенеджерЗаписи.Период = Выборка.Период;
		МенеджерЗаписи.Прочитать();
		ЗаполнитьЗначенияСвойств(ДокументыФизическогоЛица, МенеджерЗаписи);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПрочитатьГражданствоФизическогоЛица()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ГражданствоФизическихЛицСрезПоследних.Период КАК Период,
		|	ГражданствоФизическихЛицСрезПоследних.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ГражданствоФизическихЛицСрезПоследних.Страна КАК Страна,
		|	ГражданствоФизическихЛицСрезПоследних.ИНН КАК ИНН
		|ИЗ
		|	РегистрСведений.ГражданствоФизическихЛиц.СрезПоследних(, ФизическоеЛицо = &ФизическоеЛицо) КАК ГражданствоФизическихЛицСрезПоследних";
	
	Запрос.УстановитьПараметр("ФизическоеЛицо", Объект.Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(ГражданствоФизическихЛиц, Выборка);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьНаименованиеФизЛицаИСотрудника(ТекущийОбъект)
	
	ТекущийОбъект.Наименование = КадровыйУчетКлиентСервер.ПолноеНаименованиеСотрудника(
		Объект.Фамилия, Объект.Имя, Объект.Отчество, Объект.УточнениеНаименования);
	ТекущийОбъект.ФИО = КадровыйУчетКлиентСервер.ПолноеНаименованиеСотрудника(
		Объект.Фамилия, Объект.Имя, Объект.Отчество, "");
	Инициалы = ФизическиеЛицаЗарплатаКадрыКлиентСервер.ИнициалыПоИмениОтчеству(
		Объект.Имя, Объект.Отчество);
	ТекущийОбъект.Инициалы = Инициалы;
	НаборЗаписей = РегистрыСведений.ФИОФизическихЛиц.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ФизическоеЛицо.Установить(Объект.Ссылка);
	Запись = НаборЗаписей.Добавить();
	ЗаполнитьЗначенияСвойств(Запись, ТекущийОбъект);
	Запись.ФизическоеЛицо = Объект.Ссылка;
	Запись.Период = ОбщегоНазначения.ТекущаяДатаПользователя();
	НаборЗаписей.ОбменДанными.Загрузка = Истина;
	НаборЗаписей.Записать();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Сотрудники.Ссылка КАК Ссылка,
		|	Сотрудники.УточнениеНаименования КАК УточнениеНаименования,
		|	Сотрудники.Наименование КАК Наименование
		|ИЗ
		|	Справочник.Сотрудники КАК Сотрудники
		|ГДЕ
		|	Сотрудники.ФизическоеЛицо = &ФизическоеЛицо";
	
	Запрос.УстановитьПараметр("ФизическоеЛицо", Объект.Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	ПолноеНаименованиеСотрудника = КадровыйУчетКлиентСервер.ПолноеНаименованиеСотрудника(
		Объект.Фамилия,
		Объект.Имя,
		Объект.Отчество,
		Объект.УточнениеНаименования,
		"");
	
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.Наименование = ПолноеНаименованиеСотрудника Тогда
			Продолжить;
		КонецЕсли;
		
		Сотрудник = Выборка.Ссылка.ПолучитьОбъект();
		Попытка
			Сотрудник.Заблокировать();
		Исключение
			Продолжить;
		КонецПопытки;
		
		Если Не ЗначениеЗаполнено(Выборка.УточнениеНаименования) Тогда
			Сотрудник.Наименование = ПолноеНаименованиеСотрудника;
		Иначе
			Сотрудник.Наименование = КадровыйУчетКлиентСервер.ПолноеНаименованиеСотрудника(
				Объект.Фамилия,
				Объект.Имя,
				Объект.Отчество,
				Объект.УточнениеНаименования,
				Выборка.УточнениеНаименования);
		КонецЕсли;
		
		Сотрудник.Записать();
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура СнятьПризнакУдостоверяющегоЛичностьСДругогоДокумента(ФизЛицо, ВидДокумента, Период)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДокументыФизическихЛиц.Период КАК Период,
		|	ДокументыФизическихЛиц.Физлицо КАК Физлицо,
		|	ДокументыФизическихЛиц.ВидДокумента КАК ВидДокумента
		|ИЗ
		|	РегистрСведений.ДокументыФизическихЛиц КАК ДокументыФизическихЛиц
		|ГДЕ
		|	ДокументыФизическихЛиц.Период = &Период
		|	И ДокументыФизическихЛиц.Физлицо = &ФизЛицо
		|	И ДокументыФизическихЛиц.ЯвляетсяДокументомУдостоверяющимЛичность";
	
	Запрос.УстановитьПараметр("Период", Период);
	Запрос.УстановитьПараметр("ФизЛицо", ФизЛицо);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Если Выборка.ВидДокумента <> ВидДокумента Тогда
			Запись = РегистрыСведений.ДокументыФизическихЛиц.СоздатьМенеджерЗаписи();
			ЗаполнитьЗначенияСвойств(Запись, Выборка);
			Запись.Прочитать();
			Если Запись.Выбран() Тогда
				Запись.ЯвляетсяДокументомУдостоверяющимЛичность = Ложь;
				Запись.Записать();
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция КодСтраныГражданства(Страна)
	
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Страна, "Код");
	
КонецФункции

#КонецОбласти
